IDEA Open Model
WeldData.ConnectedPartIds Property
Compatible with IDEA StatiCa v 10.1
 Id of the weld
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public List<string> ConnectedPartIds { get; set; }
Public Property ConnectedPartIds As List(Of String)
	Get
	Set
public:
property List<String^>^ ConnectedPartIds {
	List<String^>^ get ();
	void set (List<String^>^ value);
}
Property Value
Type: List<String>
See Also
Reference
WeldData Class
IdeaRS.OpenModel.Connection Namespace